; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 632483 2 3 3 7 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	infrared0 - mode
	image1 - mode
	spectrograph2 - mode
	Star1 - direction
	Star4 - direction
	GroundStation2 - direction
	Star0 - direction
	GroundStation6 - direction
	GroundStation5 - direction
	Star3 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 infrared0)
	(supports instrument1 image1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument2 spectrograph2)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
)
(:goal (and
	(pointing satellite0 Star4)
	(pointing satellite1 Star1)
	(have_image Planet7 image1)
	(have_image Planet8 image1)
	(have_image Planet9 image1)
	(have_image Phenomenon10 spectrograph2)
))

)

; plan
1. (turn_to satellite1 star1 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star1)
   goals met: 1 of 6
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 6
3. (turn_to satellite0 planet9 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet9)
   goals met: 1 of 6
4. (turn_to satellite0 groundstation6 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 groundstation6)
   goals met: 1 of 6
5. (turn_to satellite1 phenomenon10 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 phenomenon10)
   goals met: 0 of 6
6. (calibrate satellite0 instrument1 groundstation6)
   added: (calibrated instrument1)
   goals met: 0 of 6
7. (turn_to satellite1 star1 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star1)
   goals met: 1 of 6
8. (turn_to satellite0 phenomenon10 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 phenomenon10)
   goals met: 1 of 6
9. (take_image satellite0 phenomenon10 instrument1 spectrograph2)
   added: (have_image phenomenon10 spectrograph2)
   goals met: 2 of 6
10. (turn_to satellite0 star4 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star4)
   goals met: 3 of 6
11. (turn_to satellite0 planet9 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet9)
   goals met: 2 of 6
12. (take_image satellite0 planet9 instrument1 image1)
   added: (have_image planet9 image1)
   goals met: 3 of 6
13. (turn_to satellite0 star4 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star4)
   goals met: 4 of 6
14. (turn_to satellite0 planet8 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet8)
   goals met: 3 of 6
15. (take_image satellite0 planet8 instrument1 image1)
   added: (have_image planet8 image1)
   goals met: 4 of 6
16. (turn_to satellite0 star4 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star4)
   goals met: 5 of 6
17. (turn_to satellite0 planet7 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet7)
   goals met: 4 of 6
18. (take_image satellite0 planet7 instrument1 image1)
   added: (have_image planet7 image1)
   goals met: 5 of 6
19. (turn_to satellite0 star4 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star4)
   goals met: 6 of 6
